README.org
#+TITLE:     React - The Complete Guide
#+AUTHOR:    Martim Lima
#+EMAIL:     (concat "martim.d.lima" at-sign "protonmail.com")
#+DATE:      10-10-2020
#+LANGUAGE:  en
#+OPTIONS:   H:4 num:nil toc:2
#+PROPERTY: header-args :dir ~/Documents/org/temp
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

-----

* Introduction
 :PROPERTIES:
  :CATEGORY: Introduction
  :END:

** What is React?

"A javascript Library for building User Interfaces"

A browser side javascript framework - no need for server side rendering

user Interfaces - Components - enable flexibility and reusibility by constructing small modular pieces of code

** Why React?
    :PROPERTIES:
    :CATEGORY: Introduction
    :END:

+ UI State becomes difficult to handle with Vanilla Javascript
+ Focus on Business Logic, not on preventing your App from exploding
+ Huge Ecosystem, Active Community, High Performance

** Single Page Applications / Multi Page Applications

 + Single Page Applications - Only ONE HTML Page, Content is (re)rendered on Client - Typically only ONE ReactDOM.render() call

 + Multi Page Applications - Multi HTML Pages, Content is rendered on Server - One ReactDOM.render() call per "widget"

* Refreshing Next Generation Javascript
  :PROPERTIES:
  :CATEGORY: Next Generation Javascript
  :END:

** "let" and "const"

+ var - creates a variable in javascript

+ let - variable values
+ const - constant values


** Arrow Functions

#+BEGIN_QUOTE
Arrow functions are a different way of creating functions in JavaScript. Besides a shorter syntax, they offer advantages when it comes to keeping the scope of the this  keyword
#+END_QUOTE

#+BEGIN_QUOTE
Normal Javascript Function Syntax
#+END_QUOTE

#+BEGIN_SRC javascript
    function myFnc(arg) {
        console.log(arg);
    }
#+END_SRC

#+BEGIN_QUOTE
Arrow Function Syntax
#+END_QUOTE

#+BEGIN_SRC  javascript

    // if there is just one argument the parenthesis can be omitted, but if there is none or multiple arguments they must be present

    const myFnc = (arg) {
        console.log(arg);
    }
#+END_SRC


** Exports & Imports (Modules)

#+BEGIN_QUOTE
person.js
#+END_QUOTE

#+BEGIN_SRC  javascript
    const person = {
    name: 'Max'
    }

exports default person
#+END_SRC


#+BEGIN_QUOTE
utility.js
#+END_QUOTE

#+BEGIN_SRC  javascript
    export const clean = () => {...}
    export const baseData = 10;
#+END_SRC


#+BEGIN_QUOTE
app.js
#+END_QUOTE

#+BEGIN_SRC  javascript
// default export
import person from './person.js'
import prs from './person.js'

// named export
import { baseData } from '.utility.js'
import { clean as cln } from './utility.js' // using an alias
import * from './utility' // importing all using an alias from module
#+END_SRC


** Classes

#+BEGIN_SRC  javascript
// class declaration
class Human {

    let gender;

    constructor() {
        this.gender = 'male';
    }

    printGender() {
        console.log(this.gender);
    }

}

// Inheritance
class Person extends Human {

    let name;

    constructor() {
        super();
        this.name = 'user';
    }

    printUserName() {
    console.log(this.name)
    }
}

// class usage
const somePerson = new Person()

somePerson.printUserName();
somePerson.printGender();
#+END_SRC

