README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-23 ter 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>React - The Complete Guide</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Martim Lima" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">React - The Complete Guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5848f5b">Introduction</a>
<ul>
<li><a href="#org8290851">What is React?</a></li>
<li><a href="#org98e1247">Why React?</a></li>
<li><a href="#org326b508">Single Page Applications / Multi Page Applications</a></li>
</ul>
</li>
<li><a href="#org7965f14">Refreshing Next Generation Javascript</a>
<ul>
<li><a href="#orga435c3c">&ldquo;let&rdquo; and &ldquo;const&rdquo;</a></li>
<li><a href="#org5b5cb1a">Arrow Functions</a></li>
<li><a href="#org223bdce">Exports &amp; Imports (Modules)</a></li>
<li><a href="#org6fb3e56">Classes</a></li>
<li><a href="#org98bd568">Classes, Properties and Methods</a></li>
<li><a href="#orgb151097">Spread and Rest Operator</a></li>
<li><a href="#orgb37e301">Destructuring</a></li>
</ul>
</li>
<li><a href="#org2745cfb">Understanding the Base Features &amp; Syntax</a>
<ul>
<li><a href="#org4936e69">Using a Build Workflow</a></li>
</ul>
</li>
<li><a href="#org02262ba">Working with Lists and Conditionals</a>
<ul>
<li><a href="#org8e35b96">JSX</a></li>
<li><a href="#orga3a863c">Components</a></li>
<li><a href="#org275eb1d">Props and State</a></li>
</ul>
</li>
<li><a href="#orgd52ec1b">Styling React Components &amp; Elements</a></li>
<li><a href="#orgdb52abf">Debugging React Apps</a></li>
<li><a href="#orgde6c549">Diving Deeper into Components &amp; React internals</a></li>
<li><a href="#org24336d4">Useful Resources &amp; Links</a></li>
</ul>
</div>
</div>
<hr />

<div id="outline-container-org5848f5b" class="outline-2">
<h2 id="org5848f5b">Introduction</h2>
<div class="outline-text-2" id="text-org5848f5b">
</div>

<div id="outline-container-org8290851" class="outline-3">
<h3 id="org8290851">What is React?</h3>
<div class="outline-text-3" id="text-org8290851">
<p>
&ldquo;A javascript Library for building User Interfaces&rdquo;
</p>

<p>
A browser side javascript framework - no need for server side rendering
</p>

<p>
user Interfaces - Components - enable flexibility and reusibility by constructing small modular pieces of code
</p>
</div>
</div>

<div id="outline-container-org98e1247" class="outline-3">
<h3 id="org98e1247">Why React?</h3>
<div class="outline-text-3" id="text-org98e1247">
<ul class="org-ul">
<li>UI State becomes difficult to handle with Vanilla Javascript</li>
<li>Focus on Business Logic, not on preventing your App from exploding</li>
<li>Huge Ecosystem, Active Community, High Performance</li>
</ul>
</div>
</div>

<div id="outline-container-org326b508" class="outline-3">
<h3 id="org326b508">Single Page Applications / Multi Page Applications</h3>
<div class="outline-text-3" id="text-org326b508">
<ul class="org-ul">
<li>Single Page Applications - Only ONE HTML Page, Content is (re)rendered on Client - Typically only ONE ReactDOM.render() call</li>

<li>Multi Page Applications - Multi HTML Pages, Content is rendered on Server - One ReactDOM.render() call per &ldquo;widget&rdquo;</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7965f14" class="outline-2">
<h2 id="org7965f14">Refreshing Next Generation Javascript</h2>
<div class="outline-text-2" id="text-org7965f14">
</div>

<div id="outline-container-orga435c3c" class="outline-3">
<h3 id="orga435c3c">&ldquo;let&rdquo; and &ldquo;const&rdquo;</h3>
<div class="outline-text-3" id="text-orga435c3c">
<ul class="org-ul">
<li>var - creates a variable in javascript</li>

<li>let - variable values</li>
<li>const - constant values</li>
</ul>
</div>
</div>


<div id="outline-container-org5b5cb1a" class="outline-3">
<h3 id="org5b5cb1a">Arrow Functions</h3>
<div class="outline-text-3" id="text-org5b5cb1a">
<blockquote>
<p>
Arrow functions are a different way of creating functions in JavaScript. Besides a shorter syntax, they offer advantages when it comes to keeping the scope of the this  keyword
</p>
</blockquote>

<blockquote>
<p>
Normal Javascript Function Syntax
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-javascript">    <span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">myFnc</span>(<span style="color: #6c71c4;">arg</span>) {
        console.log(arg);
    }
</pre>
</div>

<blockquote>
<p>
Arrow Function Syntax
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-javascript">
    <span style="color: #405A61;">// </span><span style="color: #405A61;">if there is just one argument the parenthesis can be omitted, but if there is none or multiple arguments they must be present</span>

    <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">myFnc</span> = (arg) {
        console.log(arg);
    }
</pre>
</div>
</div>
</div>


<div id="outline-container-org223bdce" class="outline-3">
<h3 id="org223bdce">Exports &amp; Imports (Modules)</h3>
<div class="outline-text-3" id="text-org223bdce">
<blockquote>
<p>
person.js
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-javascript">    <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">person</span> = {
    name: <span style="color: #2aa198;">'Max'</span>
    }

exports <span style="color: #859900; font-weight: bold;">default</span> person
</pre>
</div>


<blockquote>
<p>
utility.js
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-javascript">    <span style="color: #859900; font-weight: bold;">export</span> <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">clean</span> = () =&gt; {...}
    <span style="color: #859900; font-weight: bold;">export</span> <span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">baseData</span> = <span style="color: #d33682; font-weight: bold;">10</span>;
</pre>
</div>


<blockquote>
<p>
app.js
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">default export</span>
<span style="color: #859900; font-weight: bold;">import</span> person from <span style="color: #2aa198;">'./person.js'</span>
<span style="color: #859900; font-weight: bold;">import</span> prs from <span style="color: #2aa198;">'./person.js'</span>

<span style="color: #405A61;">// </span><span style="color: #405A61;">named export</span>
<span style="color: #859900; font-weight: bold;">import</span> { baseData } from <span style="color: #2aa198;">'.utility.js'</span>
<span style="color: #859900; font-weight: bold;">import</span> { clean as cln } from <span style="color: #2aa198;">'./utility.js'</span> <span style="color: #405A61;">// </span><span style="color: #405A61;">using an alias</span>
<span style="color: #859900; font-weight: bold;">import</span> * from <span style="color: #2aa198;">'./utility'</span> <span style="color: #405A61;">// </span><span style="color: #405A61;">importing all using an alias from module</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org6fb3e56" class="outline-3">
<h3 id="org6fb3e56">Classes</h3>
<div class="outline-text-3" id="text-org6fb3e56">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">class declaration</span>
<span style="color: #859900; font-weight: bold;">class</span> Human {

    <span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">gender</span>;

    constructor() {
        <span style="color: #d33682; font-weight: bold;">this</span>.gender = <span style="color: #2aa198;">'male'</span>;
    }

    printGender() {
        console.log(<span style="color: #d33682; font-weight: bold;">this</span>.gender);
    }

}

<span style="color: #405A61;">// </span><span style="color: #405A61;">Inheritance</span>
<span style="color: #859900; font-weight: bold;">class</span> Person <span style="color: #859900; font-weight: bold;">extends</span> Human {

    <span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">name</span>;

    constructor() {
        <span style="color: #859900; font-weight: bold;">super</span>();
        <span style="color: #d33682; font-weight: bold;">this</span>.name = <span style="color: #2aa198;">'user'</span>;
    }

    printUserName() {
    console.log(<span style="color: #d33682; font-weight: bold;">this</span>.name)
    }
}

<span style="color: #405A61;">// </span><span style="color: #405A61;">class usage</span>
<span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">somePerson</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">Person</span>()

somePerson.printUserName();
somePerson.printGender();
</pre>
</div>
</div>
</div>
