README.org
** Classes, Properties and Methods

- Properties are like "variables attached to classes/objects"

#+BEGIN_SRC javascript
// ES6
constructor() {
this.property = "value";
}

//ES7
this.property = "value";
#+END_SRC


- Methods are like "functions attached to classes/objects"

#+BEGIN_SRC javascript
// ES6
someMethod () { ... }

//ES7
someMethod = () => { ... }
#+END_SRC


#+BEGIN_SRC javascript
// class declaration
class Human {

    let gender = 'male'

    printGender = () => {
        console.log(this.gender);
    }

}

// Inheritance
class Person extends Human {

    name = "user"
    gender = "female"

    printUserName() {
    console.log(this.name)
    }
}

// class usage
const somePerson = new Person()

somePerson.printUserName();
somePerson.printGender();

#+END_SRC


** Spread and Rest Operator

- Spread - Used to split up array elements or object properties

#+BEGIN_SRC javascript
const newArray = [...oldArray, 1, 2];

const newObject =  { ...oldObject, newProp: 5 };
#+END_SRC

#+BEGIN_SRC javascript
const numbers = [1, 2, 3];
const newNumbers = [...numbers, 4]
#+END_SRC

- Rest - Used to merge a list of function arguments into an array
#+BEGIN_SRC javascript
function sortArgs(args) {
    return args.sort()
}
#+END_SRC

#+BEGIN_SRC javascript
const person = {
name: 'Doe'
};

const newPerson =0 {
...person,
age: 20
};
#+END_SRC

** Destructuring

#+BEGIN_QUOTE
Easily extract array elements or object properties and store them in variables
#+END_QUOTE

#+BEGIN_SRC javascript
// Array Destructuring
[a, b] = ['Hello', 'Max']
#+END_SRC

#+BEGIN_SRC javascript
{name} = {name: 'Doe', age: 20}
#+END_SRC


* Understanding the Base Features & Syntax
  :PROPERTIES:
  :CATEGORY: Base Features & Syntax
  :END:

** Using a Build Workflow

*Why?*
 + Recommended for SPAs and MPAs
 + Optimize Code
 + Use Next-Gen JavaScript Features
 + Be more Productive

*How?*
 + Use Dependency Management Tool (npm or yarn)
 + use Bundler (recommended: Webpack)
 + Use Compoler (Next-Gen JavaScript) Babel + presets
 + Use a Development Server


* Working with Lists and Conditionals
  :PROPERTIES:
  :CATEGORY: Lists & Conditionals
  :END:

** JSX

** Components

Components are the core building block of React apps. Actually, React really is just a library for creating components in its core.
A typical React app therefore could be depicted as a component tree - having one root component ("App") and then an potentially infinite amount of nested child components.
Each component needs to return/ render some JSX code - it defines which HTML code React should render to the real DOM in the end.

+ Functional Components (also referred to as "presentational", "dumb" or "stateless" components - more about this later in the course) => const cmp = () => { return <div>some JSX</div> } (using ES6 arrow functions as shown here is recommended but optional)

+ Class Components (also referred to as "containers", "smart" or "stateful" components) => class Cmp extends Component { render () { return <div>some JSX</div> } }

