README.html

<div id="outline-container-org98bd568" class="outline-3">
<h3 id="org98bd568">Classes, Properties and Methods</h3>
<div class="outline-text-3" id="text-org98bd568">
<ul class="org-ul">
<li>Properties are like &ldquo;variables attached to classes/objects&rdquo;</li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">ES6</span>
constructor() {
<span style="color: #d33682; font-weight: bold;">this</span>.property = <span style="color: #2aa198;">"value"</span>;
}

<span style="color: #405A61;">//</span><span style="color: #405A61;">ES7</span>
<span style="color: #d33682; font-weight: bold;">this</span>.property = <span style="color: #2aa198;">"value"</span>;
</pre>
</div>


<ul class="org-ul">
<li>Methods are like &ldquo;functions attached to classes/objects&rdquo;</li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">ES6</span>
someMethod () { ... }

<span style="color: #405A61;">//</span><span style="color: #405A61;">ES7</span>
someMethod = () =&gt; { ... }
</pre>
</div>


<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">class declaration</span>
<span style="color: #859900; font-weight: bold;">class</span> Human {

    <span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">gender</span> = <span style="color: #2aa198;">'male'</span>

    printGender = () =&gt; {
        console.log(<span style="color: #d33682; font-weight: bold;">this</span>.gender);
    }

}

<span style="color: #405A61;">// </span><span style="color: #405A61;">Inheritance</span>
<span style="color: #859900; font-weight: bold;">class</span> Person <span style="color: #859900; font-weight: bold;">extends</span> Human {

    name = <span style="color: #2aa198;">"user"</span>
    gender = <span style="color: #2aa198;">"female"</span>

    printUserName() {
    console.log(<span style="color: #d33682; font-weight: bold;">this</span>.name)
    }
}

<span style="color: #405A61;">// </span><span style="color: #405A61;">class usage</span>
<span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">somePerson</span> = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900;">Person</span>()

somePerson.printUserName();
somePerson.printGender();

</pre>
</div>
</div>
</div>


<div id="outline-container-orgb151097" class="outline-3">
<h3 id="orgb151097">Spread and Rest Operator</h3>
<div class="outline-text-3" id="text-orgb151097">
<ul class="org-ul">
<li>Spread - Used to split up array elements or object properties</li>
</ul>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">newArray</span> = [...oldArray, <span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>];

<span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">newObject</span> =  { ...oldObject, newProp: <span style="color: #d33682; font-weight: bold;">5</span> };
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">numbers</span> = [<span style="color: #d33682; font-weight: bold;">1</span>, <span style="color: #d33682; font-weight: bold;">2</span>, <span style="color: #d33682; font-weight: bold;">3</span>];
<span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">newNumbers</span> = [...numbers, <span style="color: #d33682; font-weight: bold;">4</span>]
</pre>
</div>

<ul class="org-ul">
<li>Rest - Used to merge a list of function arguments into an array</li>
</ul>
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">sortArgs</span>(<span style="color: #6c71c4;">args</span>) {
    <span style="color: #859900; font-weight: bold;">return</span> args.sort()
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">person</span> = {
name: <span style="color: #2aa198;">'Doe'</span>
};

<span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">newPerson</span> =<span style="color: #d33682; font-weight: bold;">0</span> {
...person,
age: <span style="color: #d33682; font-weight: bold;">20</span>
};
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb37e301" class="outline-3">
<h3 id="orgb37e301">Destructuring</h3>
<div class="outline-text-3" id="text-orgb37e301">
<blockquote>
<p>
Easily extract array elements or object properties and store them in variables
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #405A61;">// </span><span style="color: #405A61;">Array Destructuring</span>
[a, b] = [<span style="color: #2aa198;">'Hello'</span>, <span style="color: #2aa198;">'Max'</span>]
</pre>
</div>

<div class="org-src-container">
<pre class="src src-javascript">{name} = {name: <span style="color: #2aa198;">'Doe'</span>, age: <span style="color: #d33682; font-weight: bold;">20</span>}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org2745cfb" class="outline-2">
<h2 id="org2745cfb">Understanding the Base Features &amp; Syntax</h2>
<div class="outline-text-2" id="text-org2745cfb">
</div>

<div id="outline-container-org4936e69" class="outline-3">
<h3 id="org4936e69">Using a Build Workflow</h3>
<div class="outline-text-3" id="text-org4936e69">
<p>
<b>Why?</b>
</p>
<ul class="org-ul">
<li>Recommended for SPAs and MPAs</li>
<li>Optimize Code</li>
<li>Use Next-Gen JavaScript Features</li>
<li>Be more Productive</li>
</ul>

<p>
<b>How?</b>
</p>
<ul class="org-ul">
<li>Use Dependency Management Tool (npm or yarn)</li>
<li>use Bundler (recommended: Webpack)</li>
<li>Use Compoler (Next-Gen JavaScript) Babel + presets</li>
<li>Use a Development Server</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org02262ba" class="outline-2">
<h2 id="org02262ba">Working with Lists and Conditionals</h2>
<div class="outline-text-2" id="text-org02262ba">
</div>

<div id="outline-container-org8e35b96" class="outline-3">
<h3 id="org8e35b96">JSX</h3>
</div>

<div id="outline-container-orga3a863c" class="outline-3">
<h3 id="orga3a863c">Components</h3>
<div class="outline-text-3" id="text-orga3a863c">
<p>
Components are the core building block of React apps. Actually, React really is just a library for creating components in its core.
A typical React app therefore could be depicted as a component tree - having one root component (&ldquo;App&rdquo;) and then an potentially infinite amount of nested child components.
Each component needs to return/ render some JSX code - it defines which HTML code React should render to the real DOM in the end.
</p>

<ul class="org-ul">
<li>Functional Components (also referred to as &ldquo;presentational&rdquo;, &ldquo;dumb&rdquo; or &ldquo;stateless&rdquo; components - more about this later in the course) =&gt; const cmp = () =&gt; { return &lt;div&gt;some JSX&lt;/div&gt; } (using ES6 arrow functions as shown here is recommended but optional)</li>

<li>Class Components (also referred to as &ldquo;containers&rdquo;, &ldquo;smart&rdquo; or &ldquo;stateful&rdquo; components) =&gt; class Cmp extends Component { render () { return &lt;div&gt;some JSX&lt;/div&gt; } }</li>
</ul>
</div>
</div>
