README.html

<div id="outline-container-org275eb1d" class="outline-3">
<h3 id="org275eb1d">Props and State</h3>
<div class="outline-text-3" id="text-org275eb1d">
<p>
props  and state  are CORE concepts of React. Actually, only changes in props  and/ or state  trigger React to re-render your components and potentially update the DOM in the browser (a detailed look at how React checks whether to really touch the real DOM is provided in section 6).
</p>

<p>
<b>Props</b>
</p>

<p>
props  allow you to pass data from a parent (wrapping) component to a child (embedded) component.
</p>

<p>
<b>Example:</b>
</p>

<p>
<b>AllPosts Component:</b>
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">posts</span> = () =&gt; {
    <span style="color: #859900; font-weight: bold;">return</span> (
        &lt;div&gt;
            &lt;Post title=<span style="color: #2aa198;">"My first Post"</span> /&gt;
        &lt;/div&gt;
    );
}
</pre>
</div>

<p>
Here, title  is the custom property (prop ) set up on the custom Post  component. We basically replicate the default HTML attribute behavior we already know (e.g. &lt;input type=&ldquo;text&rdquo;&gt;  informs the browser about how to handle that input).
</p>

<p>
<b>Post Component:</b>
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900; font-weight: bold;">const</span> <span style="color: #6c71c4;">post</span> = (props) =&gt; {
    <span style="color: #859900; font-weight: bold;">return</span> (
        &lt;div&gt;
            &lt;h1&gt;{props.title}&lt;/h1&gt;
        &lt;/div&gt;
    );
}
</pre>
</div>

<p>
The Post  component receives the props  argument. You can of course name this argument whatever you want - it&rsquo;s your function definition, React doesn&rsquo;t care! But React will pass one argument to your component function =&gt; An object, which contains all properties you set up on &lt;Post &#x2026; /&gt; .
</p>

<p>
{props.title}  then dynamically outputs the title  property of the props  object - which is available since we set the title  property inside AllPosts  component (see above).
</p>


<p>
<b>State</b>
</p>

<p>
Whilst props allow you to pass data down the component tree (and hence trigger an UI update), state is used to change the component, well, state from within.
Changes to state also trigger an UI update.
</p>

<p>
<b>Example:</b>
</p>

<p>
<b>NewPost Component:</b>
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #859900; font-weight: bold;">class</span> NewPost <span style="color: #859900; font-weight: bold;">extends</span> Component { <span style="color: #405A61;">// </span><span style="color: #405A61;">state can only be accessed in class-based components!</span>
    state = {
        counter: <span style="color: #d33682; font-weight: bold;">1</span>
    };

    render () { <span style="color: #405A61;">// </span><span style="color: #405A61;">Needs to be implemented in class-based components! Needs to return some JSX!</span>
        <span style="color: #859900; font-weight: bold;">return</span> (
            &lt;div&gt;{<span style="color: #d33682; font-weight: bold;">this</span>.state.counter}&lt;/div&gt;
        );
    }
}
</pre>
</div>

<p>
Here, the NewPost  component contains state . Only class-based components can define and use state . You can of course pass the state  down to functional components, but these then can&rsquo;t directly edit it.
</p>

<p>
state  simply is a property of the component class, you have to call it state  though - the name is not optional. You can then access it via this.state  in your class JSX code (which you return in the required render()  method).
</p>

<p>
Whenever state  changes (taught over the next lectures), the component will re-render and reflect the new state. The difference to props  is, that this happens within one and the same component - you don&rsquo;t receive new data (props ) from outside!
</p>
</div>
</div>
</div>

<div id="outline-container-orgd52ec1b" class="outline-2">
<h2 id="orgd52ec1b">Styling React Components &amp; Elements</h2>
<div class="outline-text-2" id="text-orgd52ec1b">
</div>
</div>

<div id="outline-container-orgdb52abf" class="outline-2">
<h2 id="orgdb52abf">Debugging React Apps</h2>
<div class="outline-text-2" id="text-orgdb52abf">
</div>
</div>

<div id="outline-container-orgde6c549" class="outline-2">
<h2 id="orgde6c549">Diving Deeper into Components &amp; React internals</h2>
<div class="outline-text-2" id="text-orgde6c549">
</div>
</div>


<div id="outline-container-org24336d4" class="outline-2">
<h2 id="org24336d4">Useful Resources &amp; Links</h2>
<div class="outline-text-2" id="text-org24336d4">
<ul class="org-ul">
<li><a href="https://reactjs.org/docs/faq-state.html#gatsby-focus-wrapper">State and Props</a></li>

<li><a href="https://lucybain.com/blog/2016/react-state-vs-pros/">ReactJs: Props vs. State</a></li>
</ul>







<blockquote>
<p>

</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-javascript">
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 10-10-2020</p>
<p class="author">Author: Martim Lima</p>
<p class="date">Created: 2021-02-23 ter 15:46</p>
</div>
</body>
</html>
